Public Attributes | List of all members
API_RailingPanelType Struct Reference
Element Manager API
Represents a Railing Panel element. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_Elem_Head  | head
General element header.
API_Guid  | owner
GUID of the Railing Segment element owning this Railing Panel.
API_Guid  | symbID
The identifier of the symbol of this element.
bool  | visible
True, if the Railing Panel is visible.
API_RailingFrameData  | frame
Describes the boundaries of the Railing Panel.
Detailed Description
Represents a Railing Panel element.
Member Data Documentation
◆ frame
 API_RailingPanelType::frame
Describes the boundaries of the Railing Panel.
◆ head
 API_RailingPanelType::head
General element header.
◆ owner
 API_RailingPanelType::owner
GUID of the Railing Segment element owning this Railing Panel.
◆ symbID
 API_RailingPanelType::symbID
The identifier of the symbol of this element.
◆ visible
 API_RailingPanelType::visible
True, if the Railing Panel is visible.